Base_1/src/Documents/ПереоценкаВнеоборотныхАктивов/ПереоценкаВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереоценкаВнеоборотныхАктивов</name>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.СобытияОСОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПереоценкаВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <registerRecords>AccountingRegister.Типовой</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаНУ</name>
    <type>
      <types>CatalogRef.ВидыУчетаНУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодПереоценки</name>
    <type>
      <types>EnumRef.МетодыПереоценкиВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеОС</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДоходовБУ1</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДоходовБУ2</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДоходовБУ3</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДоходовНУ1</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДоходовНУ2</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДоходовНУ3</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоРасходовБУ1</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоРасходовБУ2</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоРасходовБУ3</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоРасходовНУ1</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоРасходовНУ2</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоРасходовНУ3</name>
    <type>
      <types>Characteristic.ВидыСубконтоТиповые</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовБУ</name>
    <type>
      <types>ChartOfAccountsRef.Типовой</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовНУ</name>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходовБУ</name>
    <type>
      <types>ChartOfAccountsRef.Типовой</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходовНУ</name>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьКПН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурноеПодразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПереоцененнаяСтоимостьБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимостьБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписываемаяСуммаРезерваЗаМесяцБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Base_1/src/Documents/ПереоценкаВнеоборотныхАктивов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("Автор") Тогда
			ДанныеЗаполнения.Удалить("Автор");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
    
    Если НЕ ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаНалогаНаПрибыль(Организация, Дата)
        ИЛИ НЕ УчитыватьКПН Тогда
        
        МассивНепроверяемыхРеквизитов.Добавить("ВидУчетаНУ");
                
    КонецЕсли;

    ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	УправлениеВнеоборотнымиАктивамиСервер.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "ОС", Новый Структура("ОсновноеСредство"), Отказ);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.ПереоценкаВнеоборотныхАктивов.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Если вдруг не удалось получить параметры проведения и не установлен флаг Отказ, то просто выйдем из проведения
	Если ПараметрыПроведения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	// Таблица ОС 
	ТаблицаДвиженийПараметровАмортизацииОСБухгалтерскийУчет = УчетОС.ПодготовитьТаблицыДвиженийПараметровАмортизацииОСБухгалтерскийУчет(ПараметрыПроведения.ТаблицаПараметрыАмортизацииОСБухгалтерскийУчет,
																				ПараметрыПроведения.Реквизиты, Отказ);

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	УчетОС.СформироватьДвиженияРегистрацияСобытияОС(ПараметрыПроведения.ТаблицаСобытияОСОрганизаций,
		                                        ПараметрыПроведения.Реквизиты,
												Движения, Отказ);
												
											
	УчетОС.СформироватьДвиженияПараметрыАмортизацииОСБухгалтерскийУчет(ТаблицаДвиженийПараметровАмортизацииОСБухгалтерскийУчет,
		                                        Движения, Отказ);
												
	УправлениеВнеоборотнымиАктивамиСервер.СформироватьДвиженияПереоценкаВнеоборотныхАктивов(ПараметрыПроведения.СписокПереоцененныхОC,
												ПараметрыПроведения.ТаблицаДокументовПереоценкиВА,
												ПараметрыПроведения.Реквизиты,
												Движения, Отказ);											

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ УчитыватьКПН Тогда
		ВидУчетаНУ = Справочники.ВидыУчетаНУ.ПустаяСсылка();
	КонецЕсли;	              	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
